# Series

In [32]:
import numpy as np
import pandas as pd
%matplotlib inline

In [33]:
obj = pd.Series([4,7,-5,3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [34]:
obj.values

array([ 4,  7, -5,  3], dtype=int64)

In [35]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [36]:
obj2 = pd.Series([4,7,-5,3],index = ['d','b','a','c'])
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [37]:
obj2['a']

-5

In [38]:
obj2['d']

4

In [39]:
obj2[['c','a','d']]

c    3
a   -5
d    4
dtype: int64

In [40]:
obj2[obj2 > 0]

d    4
b    7
c    3
dtype: int64

In [41]:
obj2 * 0

d    0
b    0
a    0
c    0
dtype: int64

In [42]:
np.exp(obj2)

d      54.598150
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

In [43]:
'b' in obj2

True

In [44]:
'c' in obj2

True

In [45]:
sdata = {'ohio':35000,'Texas' : 71000,
        'Oregon' : 16000,'Utah' :5000}
obj3 = pd.Series(sdata)

In [46]:
obj3

ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [47]:
states = ['California','ohio','Oregon','Texas']
obj4 = pd.Series(sdata,index = states)
obj4

California        NaN
ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [48]:
pd.isnull(obj4)

California     True
ohio          False
Oregon        False
Texas         False
dtype: bool

In [49]:
pd.notnull(obj4)

California    False
ohio           True
Oregon         True
Texas          True
dtype: bool

In [50]:
obj3.isnull()

ohio      False
Texas     False
Oregon    False
Utah      False
dtype: bool

In [51]:
obj3

ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [52]:
obj4

California        NaN
ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [53]:
obj4.name = 'population'
obj4.index.name = 'state'
obj4

state
California        NaN
ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [54]:
#in-place operations
obj.index = ['Bob','Steve','jeff','Ryan']
obj

Bob      4
Steve    7
jeff    -5
Ryan     3
dtype: int64

# Dataframe

In [72]:
data = {'state':['ohio','ohio','ohio','nevada','nevada'],
        'year' :[2000, 2001, 2002, 2001, 2002],
        'pop'  :[1.5,1.7,3.6,2.4,2.9]}
frame = pd.DataFrame(data)
frame

    state  year  pop
0    ohio  2000  1.5
1    ohio  2001  1.7
2    ohio  2002  3.6
3  nevada  2001  2.4
4  nevada  2002  2.9

In [73]:
 pd.DataFrame(data, columns=['year', 'state', 'pop'])

   year   state  pop
0  2000    ohio  1.5
1  2001    ohio  1.7
2  2002    ohio  3.6
3  2001  nevada  2.4
4  2002  nevada  2.9

In [74]:
frame2 = pd.DataFrame(data,columns = ['year','state','pop','debt'],
                      index = ['one','two','three','four','five'])
frame2

       year   state  pop debt
one    2000    ohio  1.5  NaN
two    2001    ohio  1.7  NaN
three  2002    ohio  3.6  NaN
four   2001  nevada  2.4  NaN
five   2002  nevada  2.9  NaN

In [75]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [76]:
frame2['state']

one        ohio
two        ohio
three      ohio
four     nevada
five     nevada
Name: state, dtype: object

In [77]:
frame['pop']

0    1.5
1    1.7
2    3.6
3    2.4
4    2.9
Name: pop, dtype: float64

In [78]:
frame2.year

one      2000
two      2001
three    2002
four     2001
five     2002
Name: year, dtype: int64

In [79]:
frame2['year']

one      2000
two      2001
three    2002
four     2001
five     2002
Name: year, dtype: int64

In [86]:
frame2.ix['three'] #it use to extract the wholw row with columns

D:\Anaconda\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

year     2002
state    ohio
pop       3.6
debt        2
Name: three, dtype: object

In [87]:
frame2['debt'] = 16.5

In [88]:
frame2

       year   state  pop  debt
one    2000    ohio  1.5  16.5
two    2001    ohio  1.7  16.5
three  2002    ohio  3.6  16.5
four   2001  nevada  2.4  16.5
five   2002  nevada  2.9  16.5

In [84]:
frame2['debt'] = np.arange(5.)

In [85]:
frame2

       year   state  pop  debt
one    2000    ohio  1.5   0.0
two    2001    ohio  1.7   1.0
three  2002    ohio  3.6   2.0
four   2001  nevada  2.4   3.0
five   2002  nevada  2.9   4.0

In [90]:
val = pd.Series([-1.2, -1.5, -1.7], index=['two', 'four', 'five'])

In [91]:
frame2['debt'] = val

In [92]:
frame2

       year   state  pop  debt
one    2000    ohio  1.5   NaN
two    2001    ohio  1.7  -1.2
three  2002    ohio  3.6   NaN
four   2001  nevada  2.4  -1.5
five   2002  nevada  2.9  -1.7

In [93]:
frame2['eastern'] = frame2.state == 'Ohio'

In [94]:
frame2

       year   state  pop  debt  eastern
one    2000    ohio  1.5   NaN    False
two    2001    ohio  1.7  -1.2    False
three  2002    ohio  3.6   NaN    False
four   2001  nevada  2.4  -1.5    False
five   2002  nevada  2.9  -1.7    False

In [95]:
 del frame2['eastern']
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [98]:
# Another common form of data is a nested dict of dicts format:
pop =   {'Nevada': {2001: 2.4, 2002: 2.9},
         'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}
frame3 = pd.DataFrame(pop)
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [99]:
frame3.T

        2000  2001  2002
Nevada   NaN   2.4   2.9
Ohio     1.5   1.7   3.6

# Index Objects

In [104]:
obj = pd.Series(range(3), index=['a', 'b', 'c'])
obj

a    0
b    1
c    2
dtype: int64

In [105]:
index = obj.index

In [106]:
index

Index(['a', 'b', 'c'], dtype='object')

In [107]:
index[1:]

Index(['b', 'c'], dtype='object')

In [108]:
# Index objects are immutable and thus can’t be modified by the user:
index[1] = 'd'

TypeError: Index does not support mutable operations

In [111]:
# Immutability is important so that Index objects
# can be safely shared among data Structures:
index = pd.Index(np.arange(3))
obj2 = pd.Series([1.5, -2.5, 0], index=index)
obj2

0    1.5
1   -2.5
2    0.0
dtype: float64

In [112]:
 obj2.index is index

True

# Reindexing